//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2019, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************


/** @file Nvme.uni
    Nvme driver setup string definitions

**/

//---------------------------------------------------------------------------

/=#
#include "VFR.uni"

//---------------------------------------------------------------------------
#langdef   en-US "English"    // English
#langdef   x-UEFI-AMI "x-UEFI-AMI"      // AMI Mapping Language

STR_NVME_CONFIG_FORM

#string STR_NVME_CONFIG_FORM                    #language en-US "NVMe Configuration"
                                                #language x-UEFI-AMI "NVMS001"
#string STR_NVME_CONFIG_FORM_HELP               #language en-US "NVMe Device Options Settings"

#string STR_NVME_SUBTITLE_STRING                #language en-US "NVMe controller and Drive information"
                                                #language x-UEFI-AMI "NVMS002"
#string STR_NVME_HELP_STRING                    #language en-US "NVMe controller and Drive information."
#string STR_NVME_SIZE                           #language en-US "Nvme Size"
                                                #language x-UEFI-AMI "NVMS003"
                                                
#string STR_NVME0_CONTROLLER                    #language en-US "Controller 0"
                                                #language x-UEFI-AMI "NVMS004"
#string STR_NVME0_NAME                          #language en-US "Empty"
#string STR_NVME0_SIZE                          #language en-US "Empty"
                                                

#string STR_NVME1_CONTROLLER                    #language en-US "Controller 1"
                                                #language x-UEFI-AMI "NVMS005"
#string STR_NVME1_NAME                          #language en-US "Empty"
#string STR_NVME1_SIZE                          #language en-US "Empty"                                               

#string STR_NVME2_CONTROLLER                    #language en-US "Controller 2"
                                                #language x-UEFI-AMI "NVMS006"
#string STR_NVME2_NAME                          #language en-US "Empty"
#string STR_NVME2_SIZE                          #language en-US "Empty"                                                
						
#string STR_NVME3_CONTROLLER                    #language en-US "Controller 3"
                                                #language x-UEFI-AMI "NVMS007"
#string STR_NVME3_NAME                          #language en-US "Empty"
#string STR_NVME3_SIZE                          #language en-US "Empty"
                                                

#string STR_NO_NVME_DEVICE                      #language en-US "No NVME Device Found"
                                                #language x-UEFI-AMI "NVMS008"


